package hw5;//package hw5;
//
//public class HW_5_01_02_03_04 {
//    public static void main(String[] args) {
//        //Задача №1
//        //
//        //Дан массив:
//        //int[] array = {9, 2, 6, 4, 5, 12, 7, 8, 6};
//        // необходимо вывести сумму всех значений массива.
//        int[] array = {9, 2, 6, 4, 5, 12, 7, 8, 6};
//        int sum = 0;
//        for (int i = 0; i < array.length; i++) {
//            sum = sum + array[i];
//        }
//        System.out.println(sum);
////необходимо вывести максимальное значение массива.
//        int max = 0;
//        for (int i = 0; i < array.length; i++) {
//            if (max <= array[i])
//                max = array[i];
//        }
//        System.out.println(max);
//
////необходимо вывести минимальное значение массива.
//        int min = array[0];
//        for (int i = 0; i < array.length; i++){
//            if (array[i] < min)
//                min = array[i];
//            }
//        System.out.println(min);
////необходимо вывести среднее арифметическое всех значений массива.
//        int[] array2 = {1, 2, 3, 4, 5, 6, 7, 8, 9};
//        int qw = 0;
//        for ( int i = 0; i < array2.length; i++){
//            qw += array[i];}
//        int sr = qw / array2.length;
//        System.out.println(sr);
//
//        }
//
//
//
//
//
//
//
//
//
//        //Задача №2
//        //
//        //Дан массив:
//        //int[] array = {9, 2, 6, 4, 5, 12, 7, 8, 6};
//        //необходимо вывести максимальное значение массива.
//        //
//        //
//        //Задача №3
//        //
//        //Дан массив:
//        //int[] array = {9, 2, 6, 4, 5, 12, 7, 8, 6};
//        //необходимо вывести минимальное значение массива.
//        //
//        //
//        //Задача №4
//        //
//        //Дан массив:
//        //int[] array = {1, 2, 3, 4, 5, 6, 7, 8, 9};
//        //необходимо вывести среднее арифметическое всех значений массива.
//        //
//        //
//        //Задача №5
//        //
//        //Дан массив:
//        //int[][] array = {{1, 2, 3, 4, 5}, {6, 7, 8, 9}, {-1, -2, -3, -4}, {-5, -6}};
//        //необходимо вывести сумму элементов массива.
//        //
//        //
//        //Задача №6
//        //
//        //Дан массив:
//        //int[][] array = {{1, 2, 3, 4, 5}, {6, 7, 8, 9}, {-1, -2, -3, -4}, {-5, -6}};
//        //необходимо вывести максимальное значение массива.
//        //
//        //Задача №7
//        //
//        //Дан массив:
//        //int[][] array = {{1, 2, 3, 4, 5}, {6, 7, 8, 9}, {-1, -2, -3, -4}, {-5, -6}};
//        //необходимо вывести количество элементов в массиве.
//
//
//}
