package hw5;//package hw5;
//
//public class HW_5_2_03 {
//    public static void main(String[] args) {
////Дана строка:
////String s = “Посмотрите как Рите нравится ритм”;
////необходимо вывести индексы начала всех подстрок - “рит”, независимо от регистра.
////Для указанной строки ответ будет 6, 15, 29.
//        String s = "Посмотрите как Рите нравится ритм";
//        s = s.toLowerCase();
//        System.out.println(s);
//        int length = s.length();{
//            for (int i = 0; i < length; i++) {
//                int c = s.indexOf("ритр", i);
//                if (c != -1) {
//                    System.out.println(c);
//                    i = c;}
//                //надо понять как выставить вывод пустоты  ????
////                else {
////                    System.out.println("пусто и для цикла for");
////                i = length;}
//            }
//            int a = 0;
//            {
//                while (a + 3 < length) {   //почему именно 3 ??????
//                    a = s.indexOf("ритk", a);
//                    if (a != -1) {
//                        System.out.println(a);
//                        a++;
//                    } else {
//                        System.out.println("пусто для цикла while");
//                        a = length;
//                    }
//                }
//
////
//// for(int i = 0; i <= (b/3); i = i + ){
////                if ()
////            }
////        System.out.println(b/3);
////        System.out.println(b);
//
//                //System.out.println(c);
//
//
//            }
//        }
//    }
//}
