package hw5;//package hw5;
//
//public class HW_5_2_02 {
//    public static void main(String[] args) {
//// Дана строка:
////String s = “Перевыборы выбранного президента”;
////необходимо подсчитать количество букв “е” в строке.
////Для указанной строки ответ будет 4.
//        String s = "Перевыборы выбранного президента";
//        int count = 0;
//        for (int i = 0; i < s.length(); i++) {
//            if (s.charAt(i) == 'е')
//                count += 1;
//        }
//        System.out.println(count);
//
//
//    }
//}
